{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "841cb3f2",
   "metadata": {},
   "source": [
    "### H. Метро\n",
    "* Ограничение времени: 1 секунда\n",
    "* Ограничение памяти: 64Mb\n",
    "* Ввод: стандартный ввод или input.txt\n",
    "* Вывод: стандартный вывод или output.txt\n",
    "\n",
    "На некоторых кросс-платформенных станциях метро (как, например, «Третьяковская») на разные стороны платформы приходят поезда разных направлений. Таня договорилась встретиться с подругой на такой станции, но поскольку подруга приехала из другого часового пояса, то из-за джетлага сильно проспала, и Тане пришлось долго её ждать. Поезда всегда ходят точно по расписанию, и Таня знает, что поезд стоит на платформе ровно одну минуту, а интервал между поездами (время, в течение которого поезда у платформы нет) составляет a минут для поездов на первом пути и b минут для поездов на втором пути. То есть на первый путь приезжает поезд и стоит одну минуту, затем в течение a минут поезда у платформы нет, затем в течение одной минуты у платформы стоит следующий поезд и т. д.\n",
    "\n",
    "Пока Таня стояла на платформе, она насчитала n поездов на первом пути и m поездов на втором пути. Определите минимальное и максимальное время, которое Таня могла провести на платформе, или сообщите, что она точно сбилась со счёта.\n",
    "\n",
    "Все поезда, которые видела Таня, она наблюдала в течение всей минуты, то есть Таня не приходит и не уходит с платформы посередине той минуты, когда поезд стоит на платформе.\n",
    "#### Формат ввода:\n",
    "\n",
    "Первая строка входных данных содержит число a — интервал между поездами на первом пути. Вторая строка содержит число b — интервал между поездами на втором пути. Третья строка содержит число n — количество поездов на первом пути, которые увидела Таня. Четвёртая строка содержит число m — количество поездов на втором пути, которые увидела Таня. Все числа — целые, от 1 до 1000.\n",
    "#### Формат вывода:\n",
    "\n",
    "Программа должна вывести два числа: минимальное и максимальное время в минутах, которое Таня могла стоять на платформе, или одно число -1, если Таня точно ошиблась. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1137b6d",
   "metadata": {},
   "source": [
    "Пример 1:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "`1`\n",
    "\n",
    "`3`\n",
    "\n",
    "`3`\n",
    "\n",
    "`2`\n",
    "\n",
    "Вывод:\n",
    "\n",
    "`5 7`\n",
    "\n",
    "Пример 2:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "`1`\n",
    "\n",
    "`5`\n",
    "\n",
    "`1`\n",
    "\n",
    "`2`\n",
    "\n",
    "Вывод:\n",
    "\n",
    "`-1`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e51cf908",
   "metadata": {},
   "outputs": [],
   "source": [
    "def tanya(a, b, n, m):\n",
    "    array_a = [n + a * (n - 1), n + a * (n + 1)]\n",
    "    array_b = [m + b * (m - 1), m + b * (m + 1)]\n",
    "    flag = False\n",
    "    # Ищем, есть ли точки пересечения у двух интервалов\n",
    "    if (array_b[0] <= array_a[0] <= array_b[1]) or (array_b[0] <= array_a[1] <= array_b[1]) or (array_a[0] <= array_b[0] <= array_a[1]) or (array_a[0] <= array_b[1] <= array_a[1]):\n",
    "        flag = True\n",
    "    if flag:\n",
    "        print(max(array_a[0], array_b[0]), min(array_a[1], array_b[1]))\n",
    "    else:\n",
    "        print(-1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d6e0d5c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 7\n"
     ]
    }
   ],
   "source": [
    "# Test 1\n",
    "tanya(1, 3, 3, 2)\n",
    "# 5 7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e6630597",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-1\n"
     ]
    }
   ],
   "source": [
    "# Test 2\n",
    "tanya(1, 5, 1, 2)\n",
    "# -1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2540e831",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
