{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "96dc6fed",
   "metadata": {},
   "source": [
    "### E. Чемпионат по метанию коровьих лепешек\n",
    "* Ограничение времени: 1 секунда\n",
    "* Ограничение памяти: 64Mb\n",
    "* Ввод: стандартный ввод или input.txt\n",
    "* Вывод: стандартный вывод или output.txt\n",
    "\n",
    "Ежегодный турнир «Веселый коровяк» — по метанию коровьих лепешек на дальность — прошел 8–9 июля в селе Крылово Осинского района Пермского края.\n",
    "\n",
    "Участники соревнований кидают «снаряд» — спрессованный навоз, выбирая его из заранее заготовленной кучи. Желающих поупражняться в силе броска традиционно очень много — как мужчин, так и женщин. Каждую лепешку, которую метнули участники «Веселого коровяка», внимательно осматривали женщины в костюмах коров и тщательно замеряли расстояние.\n",
    "\n",
    "Соревнования по метанию коровьих лепешек проводятся в Пермском крае с 2009 года.\n",
    "\n",
    "К сожалению, после чемпионата потерялись записи с фамилиями участников, остались только записи о длине броска в том порядке, в котором их совершали участники.\n",
    "\n",
    "Трактиорист Василий помнит три факта:\n",
    "\n",
    "1) Число метров, на которое он метнул лепешку, оканчивалось на 5\n",
    "\n",
    "2) Один из победителей чемпионата метал лепешку до Василия\n",
    "\n",
    "3) Участник, метавший лепешку сразу после Василия, метнул ее на меньшее количество метров\n",
    "\n",
    "Будем считать, что участник соревнования занял k-е место, если ровно (k − 1) участников чемпионата метнули лепешку строго дальше, чем он.\n",
    "\n",
    "Какое максимально высокое место мог занять Василий?\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Первая строка входного файла содержит целое число `n` — количество участников чемпионата по метанию лепешек $(3 ≤ n ≤ 10^5)$.\n",
    "\n",
    "Вторая строка входного файла содержит `n` положительных целых чисел, каждое из которых не превышает 1000, — дальность броска участников чемпионата, приведенные в том порядке, в котором происходило метание.\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите самое высокое место, которое мог занять тракторист Василий. Если не существует ни одного участника чемпионата, который удовлетворяет, описанным выше условиям, выведите число 0. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30a1ea85",
   "metadata": {},
   "source": [
    "Пример 1:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "```\n",
    "7\n",
    "10 20 15 10 30 5 1\n",
    "```\n",
    "\n",
    "Вывод:\n",
    "\n",
    "`6`\n",
    "\n",
    "Пример 2:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "```\n",
    "3\n",
    "15 15 10\n",
    "```\n",
    "\n",
    "Вывод:\n",
    "\n",
    "`1`\n",
    "\n",
    "Пример 3:\n",
    "\n",
    "Ввод:\n",
    "\n",
    "```\n",
    "3\n",
    "10 15 20\n",
    "```\n",
    "\n",
    "Вывод:\n",
    "\n",
    "`0`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "51b8d596",
   "metadata": {},
   "outputs": [],
   "source": [
    "def toss(array):\n",
    "    def can_be_Vasya(num1, num2):\n",
    "        if str(num1)[-1] == \"5\" and num2 < num1:\n",
    "            return num1\n",
    "        \n",
    "    top = max(array)\n",
    "    top_index = array.index(top)\n",
    "    best_Vasya = []\n",
    "    for i in range(top_index, len(array) - 1):\n",
    "        if can_be_Vasya(array[i], array[i+1]):\n",
    "            best_Vasya.append(array[i])\n",
    "            \n",
    "    place = sorted(array, reverse=True)\n",
    "    # print(best_Vasya)\n",
    "    # print(max(best_Vasya))\n",
    "    if len(best_Vasya) == 0:\n",
    "        result = 0\n",
    "    else:\n",
    "        result = place.index(max(best_Vasya)) + 1\n",
    "    # print(result)\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "305845ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"15.1.txt\", \"r\") as file:\n",
    "    n = int(file.readline().strip())\n",
    "    array = list(map(int, file.readline().strip().split()))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "41618219",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "toss([10, 20, 35, 15, 2, 3, 4, 35, 35, 7])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "287749eb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
