{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0f0bf97f",
   "metadata": {},
   "source": [
    "### D. Клавиатура\n",
    "* Ограничение времени: 1 секунда\n",
    "* Ограничение памяти: 64Mb\n",
    "* Ввод: стандартный ввод или input.txt\n",
    "* Вывод: стандартный вывод или output.txt\n",
    "\n",
    "На региональном этапе Всероссийской олимпиады школьников по информатике в 2009 году предлагалась следующая задача.\n",
    "\n",
    "Всем известно, что со временем клавиатура изнашивается,и клавиши на ней начинают залипать. Конечно, некоторое время такую клавиатуру еще можно использовать, но для нажатий клавиш приходиться использовать большую силу.\n",
    "\n",
    "При изготовлении клавиатуры изначально для каждой клавиши задается количество нажатий,которое она должна выдерживать. Если знать эти величины для используемой клавиатуры,то для определенной последовательности нажатых клавиш можно определить,какие клавиши в процессе их использования сломаются, а какие — нет.\n",
    "\n",
    "Требуется написать программу, определяющую, какие клавиши сломаются в процессе заданного варианта эксплуатации клавиатуры.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Первая строка входных данных содержит целое число $n (1 ≤ n ≤ 1000)$ —количество клавиш на клавиатуре. Вторая строка содержит $n$ целых чисел — $с_1, с_2, … , с_n$, где $с_i (1 ≤ c_i ≤ 100000)$ — количество нажатий,выдерживаемых i-ой клавишей. Третья строка содержит целое число $k (1 ≤ k ≤ 100000)$ — общее количество нажатий клавиш, и последняя строка содержит $k$ целых чисел $p_j (1 ≤ p_j ≤ n)$ — последовательность нажатых клавиш.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Программа должна вывести $n$ строк, содержащих информацию об исправности клавиш.Если $i$-я клавиша сломалась, то $i$-ая строка должна содержать слово `YES`,если же клавиша работоспособна — слово `NO`. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c0e6303",
   "metadata": {},
   "source": [
    "Пример:\n",
    "\n",
    "Ввод:\n",
    "```\n",
    "5\n",
    "1 50 3 4 3\n",
    "16\n",
    "1 2 3 4 5 1 3 3 4 5 5 5 5 5 4 5\n",
    "```\n",
    "Вывод:\n",
    "```\n",
    "YES\n",
    "NO\n",
    "NO\n",
    "NO\n",
    "YES\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "0380ec32",
   "metadata": {},
   "outputs": [],
   "source": [
    "def keyboard():\n",
    "    n = int(input())\n",
    "    keys_resource = list(map(int, input().split()))\n",
    "    keyboard_keys = dict.fromkeys(range(1, n+1), 0)\n",
    "    for i in range(n):\n",
    "        keyboard_keys[i+1] = keys_resource[i]\n",
    "    k = int(input())\n",
    "    sequence_of_pressing = list(map(int, input().split()))\n",
    "    for key in sequence_of_pressing:\n",
    "        keyboard_keys[key] -= 1\n",
    "    for key in range(1, n+1):\n",
    "        if keyboard_keys[key] < 0:\n",
    "            print(\"YES\")\n",
    "        else:\n",
    "            print(\"NO\")   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "53a1221a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "1 50 3 4 3\n",
      "16\n",
      "1 2 3 4 5 1 3 3 4 5 5 5 5 5 4 5\n",
      "YES\n",
      "NO\n",
      "NO\n",
      "NO\n",
      "YES\n"
     ]
    }
   ],
   "source": [
    "keyboard()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ca41d27a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
