{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d662e229",
   "metadata": {},
   "source": [
    "### I. Контрольная по ударениям\n",
    "* Ограничение времени: 1 секунда\n",
    "* Ограничение памяти: 64Mb\n",
    "* Ввод: стандартный ввод или input.txt\n",
    "* Вывод: стандартный вывод или output.txt\n",
    "\n",
    "Учительница задала Пете домашнее задание — в заданном тексте расставить ударения в словах, после чего поручила Васе проверить это домашнее задание. Вася очень плохо знаком с данной темой, поэтому он нашел словарь, в котором указано, как ставятся ударения в словах. К сожалению, в этом словаре присутствуют не все слова. Вася решил, что в словах, которых нет в словаре, он будет считать, что Петя поставил ударения правильно, если в этом слове Петей поставлено ровно одно ударение. Оказалось, что в некоторых словах ударение может быть поставлено больше, чем одним способом. Вася решил, что в этом случае если то, как Петя поставил ударение, соответствует одному из приведенных в словаре вариантов, он будет засчитывать это как правильную расстановку ударения, а если не соответствует, то как ошибку. Вам дан словарь, которым пользовался Вася и домашнее задание, сданное Петей. Ваша задача — определить количество ошибок, которое в этом задании насчитает Вася.\n",
    "#### Формат ввода\n",
    "\n",
    "Вводится сначала число N — количество слов в словаре (0≤N≤20000). Далее идет N строк со словами из словаря. Каждое слово состоит не более чем из 30 символов. Все слова состоят из маленьких и заглавных латинских букв. В каждом слове заглавная ровно одна буква — та, на которую попадает ударение. Слова в словаре расположены в алфавитном порядке. Если есть несколько возможностей расстановки ударения в одном и том же слове, то эти варианты в словаре идут в произвольном порядке. Далее идет упражнение, выполненное Петей. Упражнение представляет собой строку текста, суммарным объемом не более 300000 символов. Строка состоит из слов, которые разделяются между собой ровно одним пробелом. Длина каждого слова не превышает 30 символов. Все слова состоят из маленьких и заглавных латинских букв (заглавными обозначены те буквы, над которыми Петя поставил ударение). Петя мог по ошибке в каком-то слове поставить более одного ударения или не поставить ударения вовсе.\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите количество ошибок в Петином тексте, которые найдет Вася. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c078468",
   "metadata": {},
   "source": [
    "* Если слова нет в словаре и в нем ровно одно ударение, тогда все правильно\n",
    "* Если в словаре несколько вариантов того, как правильно ставить ударение и если Петя попал в один из этих вариантов, тогда все правильно. Если не попал ни в один, тогда ошибка\n",
    "* Если Петя указал 0 ударений или больше одного, тогда ошибка\n",
    "_________________________\n",
    "* Сначала ищем точно ошибочные слова, т.е. в которых 0 или более одного ударения\n",
    "* Затем исключаем эти слова из списка и записываем их количество в результат\n",
    "* У нас остаются слова с точно одним ударением.\n",
    "* В словаре ключом будет выступать lowercase слово, а значениями возможные варианты его написания.\n",
    "* мы идем по оставшемуся списку слов и ищем, есть ли lowercase значение этого слова в ключах словаря.\n",
    "* если нет, тогда это слово точно написано правильно и его можно не считать\n",
    "* если есть, тогда мы ищем его в значениях по этому ключу. \n",
    "* если оно там отсутствует, тогда прибавляем ошибку"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b0fb48dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "def test():\n",
    "    n = int(input())\n",
    "    dictionary = {}\n",
    "    for _ in range(n):\n",
    "        word = input()\n",
    "        if word.lower() not in dictionary.keys():\n",
    "            dictionary[word.lower()] = []\n",
    "        dictionary[word.lower()].append(word)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "71655200",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "UPPER upper\n"
     ]
    }
   ],
   "source": [
    "word1 = \"UPPER\"\n",
    "word2 = word1.lower()\n",
    "print(word1, word2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c9b24530",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
